system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solver          ArisaSTALL;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          5e-6;

// 启用可变时间步长控制
adjustTimeStep  true;

// 最大库郎数
maxCo           5.0;

// 最大时间步长（用于限制时间步长增长）
maxDeltaT       5e-5;

writeControl    adjustableRunTime;

writeInterval   1e-4;

purgeWrite      6;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;



// ************************************************************************* //
