constant/alpha.volume
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      alpha.volume;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   nonuniform List<scalar> 
214704
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           uniform 0;
    }
    IN_HUB
    {
        type            calculated;
        value           uniform 0;
    }
    IN_SHROUD
    {
        type            calculated;
        value           uniform 0;
    }
    IN_TO_ROTOR
    {
        type            calculated;
        value           uniform 0;
    }
    OUTLET
    {
        type            calculated;
        value           uniform 0;
    }
    OUT_HUB
    {
        type            calculated;
        value           uniform 0;
    }
    OUT_SHROUD
    {
        type            calculated;
        value           uniform 0;
    }
    OUT_TO_ROTOR
    {
        type            calculated;
        value           uniform 0;
    }
    ROTOR_HUB
    {
        type            calculated;
        value           uniform 0;
    }
    ROTOR_TO_IN
    {
        type            calculated;
        value           uniform 0;
    }
    ROTOR_TO_OUT
    {
        type            calculated;
        value           uniform 0;
    }
    ROTOR_SHROUD
    {
        type            calculated;
        value           uniform 0;
    }
    
    nonConformalCyclic_on_ROTOR_TO_IN
    {
        type            nonConformalCyclic;
    }
    nonConformalCyclic_on_IN_TO_ROTOR
    {
        type            nonConformalCyclic;
    }
    nonConformalError_on_ROTOR_TO_IN
    {
        type            nonConformalError;
    }
    nonConformalError_on_IN_TO_ROTOR
    {
        type            nonConformalError;
    }
    nonConformalCyclic_on_ROTOR_TO_OUT
    {
        type            nonConformalCyclic;
    }
    nonConformalCyclic_on_OUT_TO_ROTOR
    {
        type            nonConformalCyclic;
    }
    nonConformalError_on_ROTOR_TO_OUT
    {
        type            nonConformalError;
    }
    nonConformalError_on_OUT_TO_ROTOR
    {
        type            nonConformalError;
    }
}


// ************************************************************************* //
