constant/fvMesh/polyFaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       surfaceLabelField;
    location    "constant/fvMesh";
    object      polyFaces;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   uniform -1;

boundaryField
{
    INLET
    {
        type            polyFaces;
    }
    IN_HUB
    {
        type            polyFaces;
    }
    IN_SHROUD
    {
        type            polyFaces;
    }
    IN_TO_ROTOR
    {
        type            polyFaces;
    }
    OUTLET
    {
        type            polyFaces;
    }
    OUT_HUB
    {
        type            polyFaces;
    }
    OUT_SHROUD
    {
        type            polyFaces;
    }
    OUT_TO_ROTOR
    {
        type            polyFaces;
    }
    ROTOR_HUB
    {
        type            polyFaces;
    }
    ROTOR_TO_IN
    {
        type            polyFaces;
    }
    ROTOR_TO_OUT
    {
        type            polyFaces;
    }
    ROTOR_SHROUD
    {
        type            polyFaces;
    }
    nonConformalCyclic_on_IN_TO_ROTOR
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalCyclic;
        size            25348;
        value           nonuniform List<label> 
25348
(
625032
625032
625032
625032
625032
625032
625033
625033
...
)
;
    }
    nonConformalCyclic_on_ROTOR_TO_IN
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalCyclic;
        size            25348;
        value           nonuniform List<label> 
25348
(
655580
655581
655599
655600
657480
657481
655581
655582
...
)
;
    }
    nonConformalError_on_IN_TO_ROTOR
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalError;
        size            0;
        value           nonuniform List<label> 0();
    }
    nonConformalError_on_ROTOR_TO_IN
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalError;
        size            0;
        value           nonuniform List<label> 0();
    }
    nonConformalCyclic_on_OUT_TO_ROTOR
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalCyclic;
        size            23076;
        value           nonuniform List<label> 
23076
(
646708
646708
646708
646708
646709
646709
646709
646709
...
)
;
    }
    nonConformalCyclic_on_ROTOR_TO_OUT
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalCyclic;
        size            23076;
        value           nonuniform List<label> 
23076
(
663180
663181
663199
663200
663181
663182
663200
663201
...
)
;
    }
    nonConformalError_on_OUT_TO_ROTOR
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalError;
        size            0;
        value           nonuniform List<label> 0();
    }
    nonConformalError_on_ROTOR_TO_OUT
    {
        type            nonConformalPolyFaces;
        patchType       nonConformalError;
        size            0;
        value           nonuniform List<label> 0();
    }
}


// ************************************************************************* //
