constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 体积堵塞源项
volumeBlockage
{
    type            volumeBlockage;
    volumePhase     volume;
}

// 动量方程源项 - 作用于U场
// 直接读取 constant/bodyForce 彻体力场（由 ANN_Pre_Processing 生成）
bodyForceSourceU
{
    type            coded;
    active          yes;
    libs            ("libfvModels.so");
    field           U;
    selectionMode   cellZone;
    cellZone        ROTOR_FLUID;

    codeInclude
    #{
        #include "fvMesh.H"
        #include "volFields.H"
        #include "surfaceFields.H"
        #include "fvModels.H"
        #include "fvConstraints.H"
        #include "addToRunTimeSelectionTable.H"
        #include "fvMatrix.H"
    #};

    codeAddRhoSup
    #{
        // 获取ROTOR_FLUID单元格区域
        label zoneID = mesh().cellZones().findIndex(word("ROTOR_FLUID"));
        if (zoneID == -1)
        {
            FatalErrorInFunction
                << "Cell zone ROTOR_FLUID not found" << exit(FatalError);
        }
        const cellZone& rotorZone = mesh().cellZones()[zoneID];
        const labelList& rotorCells = rotorZone;

        // 读取 constant/bodyForce 彻体力场（单位质量力，dimAcceleration）
        IOobject bodyForceHeader
        (
            "bodyForce",
            "constant",
            mesh(),
            IOobject::MUST_READ,
            IOobject::NO_WRITE
        );
        volVectorField bodyForce(bodyForceHeader, mesh());

        const volScalarField& rhoField = mesh().lookupObject<volScalarField>("rho");

        forAll(rotorCells, i)
        {
            label celli = rotorCells[i];

            // 动量源项：f_rhs -= rho * bodyForce * V
            eqn.source()[celli] -= rhoField[celli] * bodyForce[celli] * mesh().V()[celli];
        }
    #};
}

// 能量方程源项 - 作用于e场
// 彻体力做功：功率 = (rho*bodyForce) · U_blade
bodyForceSourceE
{
    type            coded;
    active          yes;
    libs            ("libfvModels.so");
    field           e;
    selectionMode   cellZone;
    cellZone        ROTOR_FLUID;

    codeInclude
    #{
        #include "fvMesh.H"
        #include "volFields.H"
        #include "surfaceFields.H"
        #include "fvModels.H"
        #include "fvConstraints.H"
        #include "addToRunTimeSelectionTable.H"
        #include "fvMatrix.H"
    #};

    codeAddRhoSup
    #{
        // 获取ROTOR_FLUID单元格区域
        label zoneID = mesh().cellZones().findIndex(word("ROTOR_FLUID"));
        if (zoneID == -1)
        {
            FatalErrorInFunction
                << "Cell zone ROTOR_FLUID not found" << exit(FatalError);
        }
        const cellZone& rotorZone = mesh().cellZones()[zoneID];
        const labelList& rotorCells = rotorZone;

        // 读取 constant/bodyForce 彻体力场（单位质量力，dimAcceleration）
        IOobject bodyForceHeader
        (
            "bodyForce",
            "constant",
            mesh(),
            IOobject::MUST_READ,
            IOobject::NO_WRITE
        );
        volVectorField bodyForce(bodyForceHeader, mesh());

        const volScalarField& rhoField = mesh().lookupObject<volScalarField>("rho");

        // 旋转参数（与转子一致）
        scalar rpm = 17188.7;
        scalar omega = rpm * (2.0 * M_PI) / 60.0;

        forAll(rotorCells, i)
        {
            label celli = rotorCells[i];

            vector cellCenter = mesh().C()[celli];

            // 叶片周向线速度: U_blade = Omega × r
            scalar r = mag(vector(cellCenter.x(), cellCenter.y(), 0.0));
            scalar theta = Foam::atan2(cellCenter.y(), cellCenter.x());
            vector eTheta(-Foam::sin(theta), Foam::cos(theta), 0.0);
            vector U_blade = omega * r * eTheta;

            // 彻体力做功功率密度：(rho*bodyForce) · U_blade
            vector bodyForceDensity = rhoField[celli] * bodyForce[celli];
            scalar bodyForcePower = (bodyForceDensity & U_blade) * mesh().V()[celli];

            // 能量源项
            eqn.source()[celli] -= bodyForcePower;
        }
    #};
}

// ************************************************************************* //
