constant/lambda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      lambda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [];

internalField   nonuniform List<scalar> 
214704
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    INLET
    {
        type            calculated;
        value           uniform 1;
    }
    IN_HUB
    {
        type            calculated;
        value           uniform 1;
    }
    IN_SHROUD
    {
        type            calculated;
        value           uniform 1;
    }
    IN_TO_ROTOR
    {
        type            calculated;
        value           uniform 1;
    }
    OUTLET
    {
        type            calculated;
        value           uniform 1;
    }
    OUT_HUB
    {
        type            calculated;
        value           uniform 1;
    }
    OUT_SHROUD
    {
        type            calculated;
        value           uniform 1;
    }
    OUT_TO_ROTOR
    {
        type            calculated;
        value           uniform 1;
    }
    ROTOR_HUB
    {
        type            calculated;
        value           nonuniform List<scalar> 
4400
(
0.936905
0.870865
0.829045
0.810366
0.804425
0.816627
0.837434
0.864444
...
)
;
    }
    ROTOR_TO_IN
    {
        type            calculated;
        value           nonuniform List<scalar> 
7600
(
0.994879
0.997399
0.994385
0.993407
0.994136
0.995116
0.995178
0.995197
...
)
;
    }
    ROTOR_TO_OUT
    {
        type            calculated;
        value           nonuniform List<scalar> 
7600
(
0.997238
0.995706
0.994846
0.994955
0.995394
0.994306
0.996263
0.994112
...
)
;
    }
    ROTOR_SHROUD
    {
        type            calculated;
        value           uniform 1;
    }
    nonConformalCyclic_on_IN_TO_ROTOR
    {
        type            nonConformalCyclic;
    }
    nonConformalCyclic_on_ROTOR_TO_IN
    {
        type            nonConformalCyclic;
    }
    nonConformalError_on_IN_TO_ROTOR
    {
        type            nonConformalError;
    }
    nonConformalError_on_ROTOR_TO_IN
    {
        type            nonConformalError;
    }
    nonConformalCyclic_on_OUT_TO_ROTOR
    {
        type            nonConformalCyclic;
    }
    nonConformalCyclic_on_ROTOR_TO_OUT
    {
        type            nonConformalCyclic;
    }
    nonConformalError_on_OUT_TO_ROTOR
    {
        type            nonConformalError;
    }
    nonConformalError_on_ROTOR_TO_OUT
    {
        type            nonConformalError;
    }
}


// ************************************************************************* //
