0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    ROTOR_HUB
    {
        type            zeroGradient;
    }
    ROTOR_TO_IN
    {
        type            zeroGradient;
    }
    ROTOR_TO_OUT
    {
        type            zeroGradient;
    }
    ROTOR_SHROUD
    {
        type            zeroGradient;
    }
    INLET
    {
        type            totalPressure;
        p0              uniform 101325;
        psi             none;
        value           uniform 101325;
    }
    IN_HUB
    {
        type            zeroGradient;
    }
    IN_SHROUD
    {
        type            zeroGradient;
    }
    IN_TO_ROTOR
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            fixedMean;
        meanValue       129061;
        value           uniform 129061;
    }
    OUT_HUB
    {
        type            zeroGradient;
    }
    OUT_SHROUD
    {
        type            zeroGradient;
    }
    OUT_TO_ROTOR
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
