0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 288.15;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    ROTOR_HUB
    {
        type            fixedValue;
        value           uniform 288.15;
    }
    ROTOR_TO_IN
    {
        type            zeroGradient;
    }
    ROTOR_TO_OUT
    {
        type            zeroGradient;
    }
    ROTOR_SHROUD
    {
        type            fixedValue;
        value           uniform 288.15;
    }
    INLET
    {
        type            totalTemperature;
        gamma           1.4;
        T0              uniform 288.15;
        value           uniform 288.15;
    }
    IN_HUB
    {
        type            fixedValue;
        value           uniform 288.15;
    }
    IN_SHROUD
    {
        type            fixedValue;
        value           uniform 288.15;
    }
    IN_TO_ROTOR
    {
        type            zeroGradient;
    }
    OUTLET
    {
        type            zeroGradient;
    }
    OUT_HUB
    {
        type            fixedValue;
        value           uniform 288.15;
    }
    OUT_SHROUD
    {
        type            fixedValue;
        value           uniform 288.15;
    }
    OUT_TO_ROTOR
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
