system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \    /   O peration     |
    \  /    A nd           | Version:  12+
     \/     M anipulation  |
\*---------------------------------------------------------------------------*/

points
(
    (0.179404048 0.000000000 0.000877377)
    (0.179421876 0.000000000 0.000881309)
    (0.179539305 0.000000000 0.002012137)
    (0.179539204 0.000000000 0.002014969)
    (0.179784501 0.000000000 0.003132793)
    (0.179780011 0.000000000 0.003137456)
    (0.179780003 0.000000000 0.003137390)
    (0.180034074 0.000000000 0.004255951)
    (0.180034123 0.000000000 0.004255868)
    (0.180299537 0.000000000 0.005369118)
    (0.180299643 0.000000000 0.005368991)
    (0.180304322 0.000000000 0.005370300)
    (0.180570118 0.000000000 0.006484653)
    (0.180570141 0.000000000 0.006484540)
    (0.180852599 0.000000000 0.007596440)
    (0.180852644 0.000000000 0.007596539)
    (0.180855027 0.000000000 0.007595108)
    (0.181127624 0.000000000 0.008708698)
    (0.181127648 0.000000000 0.008708765)
    (0.181398596 0.000000000 0.009823072)
    (0.185606051 0.000000000 0.001117615)
    (0.185702700 0.000000000 0.002220487)
    (0.183270299 0.000000000 0.004291231)
    (0.183512600 0.000000000 0.005396683)
    (0.184027180 0.000000000 0.007592030)
    (0.184278988 0.000000000 0.008693072)
    (0.184616080 0.000000000 0.010920816)
    (0.184842664 0.000000000 0.012030111)
    (0.185138455 0.000000000 0.013134153)
    (0.185772120 0.000000000 0.015285294)
    (0.183628512 0.000000000 0.017487660)
    (0.183927640 0.000000000 0.018608864)
    (0.184203323 0.000000000 0.019748090)
    (0.184695183 0.000000000 0.021942308)
    (0.184779640 0.000000000 0.023129830)
    (0.185018150 0.000000000 0.024258451)
    (0.185505126 0.000000000 0.026498135)
    (0.185724475 0.000000000 0.027616507)
    (0.185919796 0.000000000 0.028746899)
    (0.186353895 0.000000000 0.030996238)
    (0.188812139 0.000000000 0.001248513)
    (0.189160016 0.000000000 0.003394584)
    (0.189559968 0.000000000 0.005548911)
    (0.189796703 0.000000000 0.007736264)
    (0.190222240 0.000000000 0.009878941)
    (0.190640836 0.000000000 0.012025728)
    (0.188459726 0.000000000 0.014130429)
    (0.188977318 0.000000000 0.016310655)
    (0.189473248 0.000000000 0.018476398)
    (0.189744183 0.000000000 0.020680139)
    (0.190159988 0.000000000 0.022867093)
    (0.190555337 0.000000000 0.025063694)
    (0.188527231 0.000000000 0.027369774)
    (0.188914850 0.000000000 0.029608420)
    (0.189298201 0.000000000 0.031832654)
    (0.189623311 0.000000000 0.034068882)
    (0.189839657 0.000000000 0.036330710)
    (0.189961382 0.000000000 0.037476375)
    (0.190268392 0.000000000 0.039721399)
    (0.190684204 0.000000000 0.041955290)
    (0.194905543 0.000000000 0.001551181)
    (0.195094560 0.000000000 0.003655052)
    (0.195404705 0.000000000 0.005771287)
    (0.195757702 0.000000000 0.007870392)
    (0.193358373 0.000000000 0.009890900)
    (0.193755527 0.000000000 0.012004828)
    (0.194172616 0.000000000 0.014105593)
    (0.194606848 0.000000000 0.016230988)
    (0.194817199 0.000000000 0.018368581)
    (0.195204030 0.000000000 0.020492555)
    (0.195539428 0.000000000 0.022625496)
    (0.195856904 0.000000000 0.024764827)
    (0.193756059 0.000000000 0.027017837)
    (0.194079986 0.000000000 0.029222987)
    (0.194380572 0.000000000 0.031374266)
    (0.194648307 0.000000000 0.033552130)
    (0.194785898 0.000000000 0.035755094)
    (0.194876562 0.000000000 0.036874031)
    (0.195120427 0.000000000 0.039064873)
    (0.195476568 0.000000000 0.041249742)
    (0.201101558 0.000000000 0.001885580)
    (0.198346387 0.000000000 0.003774292)
    (0.198630754 0.000000000 0.005845583)
    (0.198938878 0.000000000 0.007911686)
    (0.199240943 0.000000000 0.009982185)
    (0.199556588 0.000000000 0.012047159)
    (0.199757530 0.000000000 0.014114217)
    (0.200044912 0.000000000 0.016191758)
    (0.200355365 0.000000000 0.018247414)
    (0.200660152 0.000000000 0.020314236)
    (0.200918046 0.000000000 0.022395612)
    (0.198710487 0.000000000 0.024587679)
    (0.198984530 0.000000000 0.026681188)
    (0.199235785 0.000000000 0.028827523)
    (0.199459024 0.000000000 0.030920698)
    (0.199666994 0.000000000 0.033045094)
    (0.199783285 0.000000000 0.035179541)
    (0.199791698 0.000000000 0.036276271)
    (0.199972425 0.000000000 0.038410463)
...
);

fields
(
    rho
    U
    p
);

#includeEtc "caseDicts/functions/probes/probes.cfg"

// ************************************************************************* //
